pipeline = {
    "诊断": {
        "prompt": {
            "prompt": "请你根据患者信息诊断出所患疾病，只需回答出疾病名称，不知道就回答无法确定。\n患者信息：{患者信息}\n回答：",
            "keys": ['{患者信息}']
        },
        "return_json": False,
        "inp": ["患者信息"],
        "out": "疾病",
        "next": ["是否确诊"]
    },
    "获取出生日期": {
        'prompt': {
            "prompt": "请你根据患者信息提取出患者的出生日期，返回格式yyyy-mm-dd。\n患者信息：{患者信息}\n回答：",
            "keys": ['{患者信息}']
        },
        "return_json": False,
        'inp': ['患者信息'],
        'out': '出生日期',
        'next': ['计算年龄'],
    },
}